{
  "domain": "ImsLecturers",
  "module": "Handcrafted NLU for lecturers at the IMS",
  "tests": [
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        }
      ],
      "sentences": [
        "Hi!",
        "Hello",
        "Hey",
        "Good morning",
        "good morning",
        "Good evening",
        "good evening",
        "Hi there",
        "Hey there"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "external"
        }
      ],
      "sentences": [
        "Hey! I'm looking for a lecturer belonging to a department outside the IMS",
        "Hi! I'm looking for a lecturer who does not belong to a department at the IMS",
        "Hello, I'm looking for a lecturer who works at a department outside the IMS",
        "Hi, I'm searching for a lecturer working outside the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": "department",
          "type": "inform",
          "value": "external"
        }
      ],
      "sentences": [
        "I'm searching for a lecturer who is external to the IMS",
        "I'm searching for a lecturer belonging to a department outside the IMS",
        "I'm searching for a lecturer who does not work at a department at the IMS",
        "I'm looking for a lecturer working at a chair outside the IMS",
        "I'm searching for a lecturer who works at a chair outside the IMS.",
        "I'm looking for a lecturer belonging to a chair outside the IMS",
        "I'm searching for a lecturer who does not belong to a chair offered at the IMS",
        "I'm searching for a lecturer belonging to a chair outside the IMS",
        "I'm looking for a lecturer who does not belong to a chair offered at the IMS",
        "I'm searching for a lecturer who does not belong to a chair at the IMS",
        "I'm looking for a lecturer who does not belong to a chair at the IMS",
        "I'm searching for a lecturer working at a department outside the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": "department",
          "type": "inform",
          "value": "foundations"
        }
      ],
      "sentences": [
        "I'm looking for a lecturer working at the department 'Foundations of Computational Linguistics'.",
        "I'm searching for a lecturer working at the department 'Foundations of Computational Linguistics'.",
        "I'm looking for a lecturer working at the department foundations of computational linguistics.",
        "I'm searching for a lecturer working at the department foundations of computational linguistics.",
        "I'm looking for a lecturer working at the chair 'Foundations of Computational Linguistics'. ",
        "I'm searching for a lecturer working at the chair 'Foundations of Computational Linguistics'.",
        "I'm looking for a lecturer working at the chair foundations of computational linguistics.",
        "I'm searching for a lecturer working at the chair foundations of computational linguistics. ",
        "I'm looking for a lecturer working at the department foundations of cl.",
        "I'm looking for a lecturer working at the chair Foundations of CL.",
        "I'm searching for a lecturer working at the department 'Foundations of CL'.",
        "I'm looking for a lecturer belonging to the department 'Foundations of Computational Linguistics'. ",
        "I'm looking for a lecturer belonging to the chair 'Foundations of CL'.",
        "I'm looking for a lecturer who works at the chair 'Foundations of CL'.",
        "I'm searching for a lecturer who works at the chair foundations of computational linguistics.",
        "I'm searching for a lecturer who is working at the department foundations of cl.",
        "I'm looking for a lecturer headed at the department foundations of computational linguistics. ",
        "I'm looking for a lecturer headed at the chair foundations of cl."
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "phonetics"
        }
      ],
      "sentences": [
        "Hi! I'm looking for a lecturer headed at the department digital phonetics.",
        "Hey! I'm searching for a lecturer headed at the chair 'Digital Phonetics'. ",
        "Hi! I'm looking for a lecturer working at the department digital phonetics. ",
        "Hey! I'm searching for a lecturer working at the chair 'Digital Phonetics'."
      ]
    },
    {
      "acts": [
        {
          "slot": "department",
          "type": "inform",
          "value": "phonetics"
        }
      ],
      "sentences": [
        "I'm looking for a lecturer who works at the department digital phonetics.",
        "I'm searching for a lecturer who works at the chair digital phonetics.",
        "I'm looking for a lecturer who is working at the chair digital phonetics.",
        "I'm searching for a lecturer who is working at the chair 'Digital Phonetics'.",
        "I'm looking for a lecturer who is working at the department digital phonetics.",
        "I'm looking for a lecturer belonging to the chair digital phonetics.",
        "I'm looking for a lecturer belonging to the department 'Digital Phonetics'.",
        "I'm looking for a lecturer who belongs to the deparment digital phonetics. "
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "theory"
        }
      ],
      "sentences": [
        "Hi! I'm looking for a lecturer working at the department Theoretical Computational Linguistics. ",
        "Hey! I'm looking for a lecturer working at the chair 'Theoretical Computational Linguistics'. ",
        "Hey there! I'm looking for a lecturer who is headed at the chair theoretical cl.",
        "Hey there! I'm seaching for a lecturer headed at the department theoretical CL.",
        "Hi, I'm searching for a lecturer who is headed at the department Theoretical CL.",
        "Hey, I'm searching for a lecturer headed at the chair theoretical computational linguistics.",
        "Hi, I'm looking for a lecturer who works at the chair 'Theoretical CL'",
        "Hey, I'm searching for a lecturer who works at the department 'Theoretical CL'",
        "Hi! I'm looking for a lecturer who works at the chair 'Theoretical CL'",
        "Hello, I'm looking for a lecturer belonging to the department theoretical cl.",
        "Hello, I'm searching for a lecturer belonging to the chair 'Theoretical Computational Linguistics'",
        "Hi there, I'm looking for a lecturer who belongs to the department 'Theoretical CL'",
        "Hey there, I'm searching for a lecturer who belongs to the chair 'Theoretical CL'"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "dontcare"
        }
      ],
      "sentences": [
        "Hey! I don't care about the department the lecturer belongs to.",
        "Hi, I don't care about the chair the lecturer belongs to.",
        "Hey there, I don't care about the lecturer's department",
        "Hi there, I don't care about the lecturer's chair.",
        "Hey there, I don't care about the department the lecturer is headed in.",
        "Hi there, I don't care about the chair the lecturer is headed in.",
        "Hey! I don't care about the department the lecturer is working for. ",
        "Hi there, I don't care about the chair the lecturer is working for. ",
        "Hey there, I don't care about the chair the lecturer belongs to. "
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "agnieska falenska"
        }
      ],
      "sentences": [
        "Hi, I'm looking for Agnieska Falenska. ",
        "Hey, I'm looking for a lecturer named Agnieska Falenska"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "dr. kerstin jung"
        }
      ],
      "sentences": [
        "Hi there, I'm looking for a lecturer named Dr. Kerstin Jung.",
        "Hey, I'm searching for a lecturer named Kersting Jung.",
        "Hi, I'm searching for a lecturer named dr. Kerstin Jung.",
        "Hi, I'm looking for a lecturer named Kerstin. ",
        "Hi, I'm looking for a lecturer named dr. kerstin jung. "
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "univ. prof. dr. jonas kuhn"
        }
      ],
      "sentences": [
        "Hey there, I'm looking for a lecturer named Jonas Kuhn. ",
        "Hi, I'm searching for a lecturer named dr. Jonas Kuhn.",
        "Hey, I'm searching for a lecturer named prof. dr. jonas kuhn. ",
        "Hey there, I'm searching for a lecturer named univ. prof. dr. jonas kuhn. ",
        "Hi, I'm looking for a lecturer named Univ. Prof. Dr. Jonas Kuhn.",
        "Hi, I'm looking for a lecturer whose name is univ. prof. dr. jonas kuhn. ",
        "Hey, I'm looking for a lecturer named Univ. Prof. Dr. Jonas Kuhn. "
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "apl. prof. dr. uwe reyle"
        }
      ],
      "sentences": [
        "Hi there, I'm looking for apl. prof. dr. uwe reyle.",
        "Hey, I'm looking for a lecturer named apl. prof. dr. uwe reyle",
        "Hey there, I'm searching for a lecturer named Uwe Reyle",
        "Hey there, I'm looking for a lecturer named Dr. Uwe Reyle",
        "Hey there, I'm looking for a lecturer named Prof. Dr. Uwe Reyle",
        "Hi there, I'm looking for a lecturer named Apl. Prof. Dr. Uwe Reyle",
        "Hello, I'm searching for Uwe Reyle.",
        "Hey, I'm looking for Uwe Reyle.",
        "Hello, I'm searching for Dr. Uwe Reyle",
        "Hello, I'm seaching for Prof. Dr. Uwe Reyle",
        "Hello, I'm looking for apl. prof. dr. Uwe Reyle"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "univ. prof. dr. thang vu"
        }
      ],
      "sentences": [
        "Hi there, I'm looking for Thang Vu",
        "Hello, I'm looking for Dr. Thang Vu. ",
        "Hello, I'm looking for Prof. Dr. Thang Vu",
        "Hello, I'm looking for Univ. Prof. Dr. Thang Vu",
        "Hi, I'm looking for Professor Thang Vu",
        "Hello, I'm looking for Prof. Thang Vu.",
        "Hi, I'm searching for a lecturer named Thang Vu",
        "Hello, I'm searching for a lecturer named thang vu",
        "Hello, I'm searching for a lecturer named prof. dr. thang vu."
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "adviser"
        }
      ],
      "sentences": [
        "Hi, I'm looking for the study adviser at the IMS",
        "Hey, I'm looking for a lecturer who's position is the study adviser at the IMS",
        "Hello, I'm searching for the study adviser",
        "Hey, I'm looking for a person whose position is the study adviser at the IMS",
        "Hey, I'm looking for a lecturer whose position is the study adviser at the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "erasmus"
        }
      ],
      "sentences": [
        "Hi, I'm looking for the erasmus coordinator at the IMS",
        "Hey, I'm looking for the person responsible for erasmus matters",
        "Hi there, I'm looking for the lecturer responsible for erasmus matters",
        "Hey! I'm looking for a lecturer who is the erasmus coordinator at the IMS",
        "Hey, I'm searching for the person responsible in erasmus affairs. ",
        "Hi there, I'm looking for a person who is responsible for erasmus matters.",
        "Hey, I'm looking for a lecturer who is responsible for erasmus affairs.",
        "Hi, I'm looking for a person who is the erasmus coordinator at the IMS."
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "examination"
        }
      ],
      "sentences": [
        "Hey, I'm looking for a person responsible for examination affairs.",
        "Hey there, I'm looking for a lecturer responsible for examination matters at the IMS",
        "Hello, I'm searching for a lecturer who is repsonsible for examination affairs at the IMS",
        "Hey, I'm looking for the Chairman of the Audit Committee at the IMS",
        "Hey,there, I'm looking for a lecturer who is Chairman of the Audit Committee at the IMS",
        "Hello, I'm searching for the Chairman of the Audit Committee",
        "Hey, I'm looking for a person who takes care of examination matters at the IMS",
        "Hey there, I'm looking for a lecturer who takes care of examination affairs at the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "gender"
        }
      ],
      "sentences": [
        "Hi, I'm looking for the person responsible in gender matters.",
        "Hey, I'm looking for the person responsible in gender affairs.",
        "Hey, I'm looking for a lecturer who is responsible for gender affairs.",
        "Hi, I'm searching for a lecturer who is responsible for gender matters at the IMS.",
        "Hi, I'm looking for the Equal Opportunities Officer at the IMS",
        "Hey, I'm looking for the equal opportunities officier at the IMS",
        "Hello, I'm looking for the equal opportunities officier.",
        "Hello, I'm looking for the person responsible in equal opportunities matters",
        "Hi, I'm searching for a lecturer responsible for equal opportunities affairs. ",
        "Hi, I am looking for a person who is responsible for equality issues",
        "Hey, I am searching for a lecturer who is responsible for equality issues."
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "phd"
        }
      ],
      "sentences": [
        "Hey, I'm looking for a person who is currently a phd student at the IMS",
        "Hello, I'm looking for a lecturer who currently is a phd student at the IMS. ",
        "Hello, I'm searching for a phd student",
        "Hello, I'm looking for a phd student at the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "postdoc"
        }
      ],
      "sentences": [
        "Hi, I'm looking for a person who is a postdoc at the IMS.",
        "Hey there, I'm searching for a lecturer holding the position 'postdoc' at the IMS",
        "Hello, I'm looking for a person holding the position postdoc",
        "Hey, I'm looking for a person working as postdoc at the IMS",
        "Hello, I want to know something about a postdoc at the IMS",
        "Hello, I need some information about a postdoc at the IMS",
        "Hi there, I need some information about a lecturer who is currently holding the position postdoc at the IMS",
        "Hello, I need some information about a lecturer who's currently working as postdoc at the IMS",
        "Hello there, I  want to know something about a person holding the position postdoc"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "professor"
        }
      ],
      "sentences": [
        "Hello, I'm looking for a professor at the IMS. ",
        "Hey, I'm looking for a lecturer holding the position 'professor'",
        "Hey, I need some information about a particular professor",
        "Hello there, I want to know something about a lecturer holding the position 'professor' at the IMS.",
        "Hi, I want to know something about a person working as professor at the IMS",
        "Hello there, I need some information about a lecturer who's working as professor at the IMS",
        "Hey there, I need some details about a particular professor at the IMS",
        "Hello, I want to know some details about a lecturer who is working as a professor at the IMS",
        "Hey there, I need some facts about a professor working at the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "senate"
        }
      ],
      "sentences": [
        "Hey there, I need some information about the academic council. ",
        "Hello there, I want to know something about the academic council at the IMS",
        "Hello, I need some details about the academic council at the IMS.",
        "Hello, I'm looking for a lecturer holding the position academic council at the IMS",
        "Hey, I'm searching for a lecturer holding the position 'academic council'",
        "Hey, I need some information about the senate at the IMS",
        "Hello there, I need some facts about a lecturer who's also senate at the IMS",
        "Hi there, I'm searching for a lecturer holding the position 'senate'",
        "Hello, I'm looking for the 'senate' at the IMS",
        "Hi, I need some information about a person who's holding the position 'senate' at the IMS"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "dontcare"
        }
      ],
      "sentences": [
        "Hello, I don't care about the person's position",
        "Hi there, I don't care about the lecturer's position.",
        "Hey, I don't care whether the lecturer is holding a particular position"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "repeat",
          "value": null
        }
      ],
      "sentences": [
        "What did you just say?",
        "Can you repeat what you've just said",
        "Can you repeat the info",
        "Can you repeat the information",
        "Can you just say this again",
        "Can you repeat what you have said",
        "Can you repeat what you have just said",
        "Repeat that",
        "Say this again",
        "Can you repeat yourself",
        "Can you retell me what you've just said",
        "Can you repeat the info",
        "Can you repeat the information"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Hey, is there a lecturer named Thang Vu?",
        "Hey, is there a lecturer named Diego Frasinelli?"
      ]
    },
    {
      "acts": [
        {
          "slot": "name",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Can I get some information about a lecturer?",
        "Show me some information about Thang Vu",
        "Can I get some details about Diego Frasinelli?"
      ]
    },
    {
      "acts": [
        {
          "slot": "name",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Give me some info about Diego Frasinelli",
        "Show me some information about Diego Frasinelli",
        "Tell me something about Diego Frasinelli",
        "Can I get some information about a particular lecturer?"
      ]
    },
    {
      "acts": [
        {
          "slot": "department",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Can you tell me the department",
        "Can you give me some information about the department",
        "Tell me something about the department",
        "Tell me something about the chair",
        "Show me some details about the department",
        "Show me some information about the chair",
        "Give me some details about the department",
        "Give me some details about the chair",
        "Can I get some details about the department?",
        "Can I get some information about the chair?",
        "Show me some facts about the department",
        "Show me some facts about the chair"
      ]
    },
    {
      "acts": [
        {
          "slot": "office_hours",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Can you tell me the office hours?",
        "Can you tell me the office hour?",
        "Tell me something about the office hours",
        "Tell me something about the office hour",
        "When is her office hour?",
        "When is his office hour?",
        "When are the office hours?",
        "Show me the office hours",
        "When are her office hours",
        "When are his office hours",
        "For which time slot can I make an appointment?"
      ]
    },
    {
      "acts": [
        {
          "slot": "mail",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "What's his email?",
        "What's his e-mail address?",
        "What is his email address?",
        "What is her email address?",
        "What's her email address?",
        "What's the email address?",
        "Tell me the mail address",
        "Show me the mail address",
        "Give me the mail address",
        "Display the mail address",
        "Show me her mail address",
        "Show me her email address",
        "Show me her e-mail address",
        "Show me his email address",
        "Show me his mail address",
        "Tell me her mail address",
        "Tell me his mail address",
        "I need her e-mail address",
        "I need his e-mail address",
        "I need the email",
        "I need the email address"
      ]
    },
    {
      "acts": [
        {
          "slot": "phone",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Can I get the phone number?",
        "What's the phone number?",
        "What is her phone number?",
        "What's her phone number",
        "What's his phone number?",
        "Tell me the number",
        "Tell me the phone number",
        "Give me the phone number",
        "Give me her phone number",
        "Give me his phone number",
        "Could you give me the phone number?",
        "Could you give me his phone number?",
        "Could you give me her phone number?",
        "I need the number, please.",
        "I need the phone number, please",
        "Would you give me the phone number, please?",
        "Would you give me her phone number, please?",
        "Would you give me his phone number, please?"
      ]
    },
    {
      "acts": [
        {
          "slot": "room",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Where is her office?",
        "Where is his office?",
        "In what room is her office?",
        "In what room is his office?",
        "In which room is his office?",
        "In which room is her office?",
        "Can you tell me the office?",
        "Show me the office",
        "Tell me the office",
        "Would you give the office?",
        "Could you give me the office?",
        "Where's the office?",
        "Where's her office?",
        "In which room can I find her?",
        "In which room can I find him?",
        "What's the office number?",
        "Where can I find her?",
        "Where is her office located?",
        "Where is his office located?"
      ]
    },
    {
      "acts": [
        {
          "slot": "position",
          "type": "request",
          "value": null
        }
      ],
      "sentences": [
        "Does the lecturer hold a particular position?",
        "Does the person hold a particular position?",
        "What's the lecturer's position?",
        "What's the person's position?",
        "What's her position?",
        "What's his position?",
        "What's her position at the IMS?",
        "What's his position at the IMS?",
        "Does he hold a particular position?",
        "Does she hold a particular position?",
        "Which function does he have?",
        "Which function does she have?",
        "What's her main position?",
        "What's his main position?",
        "Which position does she hold?",
        "Which position does he hold?"
      ]
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "agnieska falenska"
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "external"
        }
      ],
      "sentences": []
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "inform",
          "value": "dr. katrin schneider"
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "external"
        }
      ],
      "sentences": []
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "name",
          "type": "request",
          "value": null
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "external"
        }
      ],
      "sentences": []
    },
    {
      "acts": [
        {
          "slot": null,
          "type": "hello",
          "value": null
        },
        {
          "slot": "position",
          "type": "inform",
          "value": "adviser"
        },
        {
          "slot": "department",
          "type": "inform",
          "value": "external"
        }
      ],
      "sentences": []
    }
  ]
}
